reports/showcase_aero/_w33b_pipe_probe/constant/fluid/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b turbulent thermal transport: eddyDiffusivity, Prt=0.85 (gold)            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalTransport;
}

RAS
{
    model   eddyDiffusivity;
    Prt     0.85;
}

// ************************************************************************* //
