reports/showcase_aero/_w33b_pipe_probe/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid p (gauge; rhoConst -> absolute level irrelevant).                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet)"
    {
        type            calculated;
        value           $internalField;
    }
    fluid_to_solid
    {
        type            calculated;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
