reports/showcase_aero/_w33b_pipe_probe/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b top-level fvSchemes (per-region schemes live in system/{fluid,solid}/).  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

// ************************************************************************* //
