reports/showcase_aero/_w33b_pipe_probe/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid fvSolution (PIMPLE transient, 2 correctors).                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}

solvers
{
    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.05;
        maxIter         50;
    }

    "(U|e|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|e|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors                 2;
    nNonOrthogonalCorrectors    0;   // mesh is perfectly orthogonal (checkMesh: 0)
    pRefCell                    0;
    pRefValue                   0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

// ************************************************************************* //
