reports/showcase_aero/_w33b_pipe_probe/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b: build the fully-developed measurement window faceZone on the fluid-side |
| interface (fluid_to_solid, y=b=0.0125) over x in [1.5,1.9] (past the ~0.75 m   |
| turbulent thermal entry; 0.1 m clear of the outlet).  Run: topoSet -region fluid|
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    fdFaces;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   fluid_to_solid;
    }
    {
        name    fdFaces;
        type    faceSet;
        action  subset;
        source  boxToFace;
        box     (1.5 0.012 -1) (1.9 0.013 1);
    }
    {
        name    fdWindow;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet fdFaces;
    }
);

// ************************************************************************* //
